app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Ganz viel unnützer Text. BEARBEITET"], ["updated_at", "2017-10-25 12:39:27.065404"], ["id", 10]]
---
  def update
    @post = Post.find(params[:id])

    if(@post.update(post_params))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.delete